---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IsVisibleParam
source: html/84c1718f-1a96-d430-32f3-edc4e980c6fc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IsVisibleParam Property

"Visible"

## Syntax (C#)
```csharp
public static ForgeTypeId IsVisibleParam { get; }
```